{
  "version": "1.0.0",
  "exportedAt": "2026-02-12T13:36:00.351Z",
  "projectName": "القصر الأبيض في أرض الجن",
  "state": {
    "currentStep": "export",
    "breakdown": [
      {
        "id": "scene_0",
        "sceneNumber": 1,
        "heading": "القصر الأبيض في أرض الجن",
        "action": "*   **الخطاف العاطفي:** مزيج متناقض بين حنين الطفولة البريء والشعور بقشعريرة باردة تسري في الجسد عند تذكر \"ذلك المكان\" تحديدًا. *   **النقطة السردية الرئيسية:** التأسيس للمكان والزمان. نحن في شمال السعودية، منطقة صحراوية شاسعة معروفة شعبيًا بأنها \"مسكن للجن\". الكاميرا (أو السرد) تركز على ذكريات الطفولة حول \"البيت الأبيض الكبير\"، ذلك المبنى المهجور الذي يقف وحيدًا ومعزولًا، والذي كان الأطفال ينجذبون إليه بفضول قاتل رغم تحذيرات الكبار المستمرة. ٢. **",
        "dialogue": [],
        "charactersPresent": []
      },
      {
        "id": "scene_1",
        "sceneNumber": 2,
        "heading": "عين على المجهول",
        "action": "*   **الخطاف العاطفي:** التوتر الخانق وحبس الأنفاس؛ تلك اللحظة التي يغلب فيها الفضول على الخوف، لتكتشف ما لا يجب أن تراه. *   **النقطة السردية الرئيسية:** تقترب الأخت الكبرى بجرأة من الباب الخشبي الضخم للبيت المهجور. تنحني لتختلس النظر عبر \"ثقب المفتاح\". السكون مخيف، وفجأة تتسع حدقة عينها رعبًا؛ فهي لا ترى ظلامًا دامسًا فحسب، بل ترى \"شيئًا\" يتحرك بوضوح في الداخل، خيالًا يمر بسرعة لا تتناسب مع كونه مكانًا مهجورًا منذ عقود. ٣. **",
        "dialogue": [],
        "charactersPresent": []
      },
      {
        "id": "scene_2",
        "sceneNumber": 3,
        "heading": "زائر وقت المغرب",
        "action": "*   **الخطاف العاطفي:** الرعب الفطري المرتبط بـ \"وقت الغروب\" في الثقافة المحلية، وتحول اللعب إلى صراع مفاجئ من أجل البقاء. *   **النقطة السردية الرئيسية:** تحل ساعة \"صلاة المغرب\" (الوقت الذي يُحذّر فيه من انتشار الشياطين). بينما الأطفال يلعبون في الخارج، يظهر فجأة \"رجل غامض\" طويل القامة، ملامحه غير واضحة. لا يمشي كالبشر بل يتربص بهم. في لحظة خاطفة، يهجم الرجل ويمسك بإحدى الأخوات، وتبدأ أصابع يده القاسية بالالتفاف حول عنقها محاولًا خنقها وسط صراخ البقية المتجمد في حناجرهم. ٤. **",
        "dialogue": [],
        "charactersPresent": []
      },
      {
        "id": "scene_3",
        "sceneNumber": 4,
        "heading": "اختفاء كالبرق",
        "action": "*   **الخطاف العاطفي:** الصدمة والذهول النفسي الذي يترك ندوبًا لا تمحى؛ الإدراك بأن ما واجهوه لم يكن بشريًا. *   **النقطة السردية الرئيسية:** بينما يبلغ الرعب ذروته ويظن الأطفال أن النهاية قد حانت، يختفي الرجل فجأة وبشكل مستحيل فيزيائيًا. يتبخر \"كالبرق\" أمام أعينهم، تاركًا الأخت تسعل وتمسك عنقها. ينتهي المشهد بالهروب الجماعي الهستيري، واليقين التام بأن حكايات الأهالي عن سكن الجن لتلك المنطقة لم تكن مجرد أساطير، بل حقيقة عاشوها بأنفسهم.",
        "dialogue": [],
        "charactersPresent": []
      }
    ],
    "script": {
      "title": "القصر الأبيض في أرض الجن",
      "scenes": [
        {
          "id": "scene_0",
          "sceneNumber": 1,
          "heading": "القصر الأبيض في أرض الجن",
          "action": "تفتح الكاميرا بلقطة واسعة لصحراء شمالية قاحلة، حيث تعانق الرمال الذهبية سماء زرقاء شاحبة. في المنتصف، يقف مبنى أبيض ضخم مكون من طابقين، طلاؤه مقشر كجلد ميت، ونوافذه سوداء فارغة كحجر العيون. نسمع صوت الرياح وهي تصفر عبر الشقوق الجدارية ممزوجة بنباح كلب بعيد. الكاميرا تقترب ببطء شديد نحو المبنى الذي يبدو معزولاً بشكل غير طبيعي عن باقي العمران، بينما تتطاير أعشاب صحراوية يابسة أمام العدسة.",
          "dialogue": [],
          "charactersPresent": []
        },
        {
          "id": "scene_1",
          "sceneNumber": 2,
          "heading": "عين على المجهول",
          "action": "لقطة مقربة ليد فتاة مراهقة ترتجف قليلاً وهي تلامس الخشب المتآكل للباب الرئيسي الضخم. تنخفض الكاميرا لمستوى خصرها وهي تنحني ببطء. نرى جانب وجهها وهي تغلق عيناً وتضع الأخرى على ثقب المفتاح الصدئ والبارد. تنتقل الكاميرا لتصبح وجهة نظر الفتاة عبر الثقب: نرى باحة داخلية يغرقها الظلام والغبار المتطاير في شعاع ضوء خافت. فجأة، يمر خيال أسود كثيف بسرعة خاطفة من اليمين إلى اليسار، حركة أسرع من قدرة البشر. تتسع حدقة عين الفتاة في لقطة مقربة جداً وتشهق بصوت مسموع، وترتد برأسها للخلف بسرعة.",
          "dialogue": [
            {
              "speaker": "الأخت الكبرى (شهقة رعب)",
              "text": "بسم الله.. شفت شي يتحرك جوا!"
            }
          ],
          "charactersPresent": [
            "الأخت الكبرى (شهقة رعب)"
          ]
        },
        {
          "id": "scene_2",
          "sceneNumber": 3,
          "heading": "زائر وقت المغرب",
          "action": "السماء تتلون بالأحمر والأرجواني الداكن مع غروب الشمس، والظلال على الأرض تصبح طويلة ومشوهة. الأطفال يلعبون في الساحة الترابية المقابلة للمنزل، وصوت الأذان البعيد يبدأ بالظهور. فجأة، يقطع ضحكهم ظهور رجل طويل القامة بشكل غير مألوف يقف عند زاوية البيت، يرتدي ثياباً رثة، ملامح وجهه مطموسة كأنها مغطاة بغشاوة ضبابية. يتحرك الرجل نحوهم ليس بخطوات بشرية، بل بانزلاق صامت وسريع. في رمشة عين، تمتد يده الشاحبة ذات الأصابع الطويلة والقاسية لتطبق بقوة على عنق الأخت الكبرى. الغبار يتطاير حول أقدامهم وهي ترفس الهواء محاولة المقاومة.",
          "dialogue": [
            {
              "speaker": "الأخت الصغرى (صراخ هستيري)",
              "text": "فكها! يا مجرم!"
            }
          ],
          "charactersPresent": [
            "الأخت الصغرى (صراخ هستيري)"
          ]
        },
        {
          "id": "scene_3",
          "sceneNumber": 4,
          "heading": "اختفاء كالبرق",
          "action": "الكاميرا تركز بلقطة قريبة (كلوز أب) على وجه الأخت الذي بدأ يزرق من الاختناق، وعيونها شاخصة برعب نحو وجه المهاجم غير الواضح. فجأة، ودون أي مقدمات بصرية أو دخان، يتلاشى الرجل من الوجود تماماً في جزء من الثانية، وكأنه خطأ تقني في شريط الفيلم. تسقط الأخت بقوة على ركبتيها فوق الرمل، تسعل بعنف وتمسك عنقها الذي يحمل بوضوح آثار أصابع حمراء داكنة. الكاميرا تهتز بعنف وهي تلاحق الأطفال وهم يركضون بهستيريا مبتعدين عن المنزل، بينما يظهر البيت الأبيض في الخلفية ثابتاً وصامتاً تحت ضوء القمر الجديد.",
          "dialogue": [
            {
              "speaker": "الراوي (صوت خارجي)",
              "text": "لم يكن وهماً.. الكدمات على رقبتي بقيت أسبوعاً، واليقين بأننا لم نكن وحدنا هناك.. بقي للأبد."
            }
          ],
          "charactersPresent": [
            "الراوي (صوت خارجي)"
          ]
        }
      ]
    },
    "characters": [
      {
        "id": "char_1770902309591_0",
        "name": "The Older Sister",
        "role": "Protagonist",
        "visualDescription": "A Middle Eastern teenage girl, approximately 16-17 years old. She has olive skin, long dark wavy hair that is slightly windblown, and wide, expressive dark brown eyes that convey intense fear. She has a slender build and wears modest, casual clothing suitable for a desert environment, such as a long-sleeved dusty beige tunic over loose trousers. A distinguishing feature in later scenes is distinct, dark red finger-shaped bruises on her neck."
      },
      {
        "id": "char_1770902309591_1",
        "name": "The Younger Sister",
        "role": "Supporting",
        "visualDescription": "A Middle Eastern female child, approximately 8-10 years old. She shares similar features with the older sister: olive skin and dark hair, which is tied back in a messy ponytail or braids. She wears a simple, faded floral dress that is dusty from playing in the sand. Her expression is one of hysterical panic and screaming. She has a small, fragile frame."
      },
      {
        "id": "char_1770902309591_2",
        "name": "The Tall Man (The Jinn)",
        "role": "Antagonist",
        "visualDescription": "A supernatural, unnaturally tall male entity. His most defining feature is his face, which is completely obscured and blurred, appearing as a foggy, featureless void. He wears tattered, ancient-looking rags in dark grey or brown that hang loosely off his frame. His skin is deathly pale. His hands are terrifyingly distinct: extremely large with elongated, hard, claw-like fingers. He appears to glide rather than walk, casting a distorted shadow.",
        "referenceImageUrl": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAABAAAAAQACAIAAADwf7zUAAAAg3pUWHRSYXcgcHJvZmlsZSB0eXBlIGlwdGMAAAiZTYs7DsIwEAV7nyJH2N28/aSmoqPgArbjlZAiBXH/AosCmNdM8aZcb/fL8nyd+ThGWT5olDUg2LAT5r4wcyexMbWDsQnBTW2Yuhg7ps/3rxX9aymrSXQBR4i3ntFyd7eoq9ZWKcsbuIYghUiq6vkAAAHNaVRYdFhNTDpjb20uYWRvYmUueG1wAAAAAAA8P3hwYWNrZXQgYmVnaW49Iu+7vyIgaWQ9Ilc1TTBNcENlaGlIenJlU3pOVGN6a2M5ZCI/PiA8eDp4bXBtZXRhIHhtbG5zOng9ImFkb2JlOm5zOm1ldGEvIiB4OnhtcHRrPSJYTVAgQ29yZSA1LjUuMCI+IDxyZGY6UkRGIHhtbG5zOnJkZj0iaHR0cDovL3d3dy53My5vcmcvMTk5OS8wMi8yMi1yZGYtc3ludGF4LW5zIyI+IDxyZGY6RGVzY3JpcHRpb24gcmRmOmFib3V0PSIiIHhtbG5zOklwdGM0eG1wRXh0PSJodHRwOi8vaXB0Yy5vcmcvc3RkL0lwdGM0eG1wRXh0LzIwMDgtMDItMjkvIiBJcHRjN+vv7dlHo9t28VVibnP7mKOt3zowuhFVelsFwQ7bk4W4LPdED1cyFb+/pFpdxzV9Ps/Y0jtGBnHqCOOezd/e0exJOSmM1of3g8o3ilK2PILoegIvP6d0atpqZJ4DkFv+/wFyBi16JPK3VQAAAABJRU5ErkJggg=="
      }
    ],
    "shotlist": [
      {
        "id": "shot_scene_0_1",
        "sceneId": "scene_0",
        "shotNumber": 1,
        "description": "An expansive aerial view of the Northern Saudi Arabian desert at golden hour. The orange sand dunes ripple infinitely like a frozen sea. In the dead center, a solitary, large white stone structure stands perfectly isolated, casting a long, distorted shadow across the sand. The scale emphasizes the 'Land of Jinn' vastness.",
        "cameraAngle": "Eye-level",
        "movement": "Zoom",
        "lighting": "Natural",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_0_1.png"
      },
      {
        "id": "shot_scene_0_2",
        "sceneId": "scene_0",
        "shotNumber": 2,
        "description": "Approaching the 'White Palace.' The architecture is a haunting mix of traditional Najdi style and decaying grandeur. The white limestone walls are cracked and sun-bleached. The low angle makes the building feel imposing and sentient, like a giant watching a child approach.",
        "cameraAngle": "Low",
        "movement": "Dolly",
        "lighting": "Chiaroscuro",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_0_2.png"
      },
      {
        "id": "shot_scene_0_3",
        "sceneId": "scene_0",
        "shotNumber": 3,
        "description": "The camera mimics the height of a small child looking up at the massive, arched wooden doorway of the palace. The wood is splintered and weathered. The sun is positioned directly behind the roofline, creating a blinding halo effect that obscures the details of the upper floors, making it look heavenly yet terrifying.",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "lighting": "Silhouette",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_0_3.png"
      },
      {
        "id": "shot_scene_0_4",
        "sceneId": "scene_0",
        "shotNumber": 4,
        "description": "Focus on a single, rusted iron ring knocker on the white door. Dust particles swirl in a sharp, narrow beam of light hitting the metal. In the background, the blurred desert heat haze shimmers, suggesting a supernatural presence or a distorted memory.",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "lighting": "Dramatic",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_0_4.png"
      },
      {
        "id": "shot_scene_0_5",
        "sceneId": "scene_0",
        "shotNumber": 5,
        "description": "A slow pan across a broken window frame on the ground floor. The interior is pitch black, creating a 'cold' visual void that contrasts with the burning orange sand outside. The slight tilt of the Dutch angle suggests that something about this place is fundamentally 'wrong' or supernatural.",
        "cameraAngle": "Dutch",
        "movement": "Pan",
        "lighting": "Cold",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_0_5.png"
      },
      {
        "id": "shot_scene_0_6",
        "sceneId": "scene_0",
        "shotNumber": 6,
        "description": "The palace captured during 'Blue Hour.' The warmth of the desert has vanished, replaced by a chilling deep blue hue. The building glows with an unnatural, pale luminescence against the darkening sky. It looks like a ghost haunting the dunes, perfectly capturing the 'cold shiver' of the childhood memory.",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "lighting": "Natural",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_0_6.png"
      },
      {
        "id": "shot_scene_1_1",
        "sceneId": "scene_1",
        "shotNumber": 1,
        "description": "A long, dimly lit hallway of an abandoned Victorian mansion. At the end of the corridor stands a massive, weathered wooden door with ornate iron carvings. A young woman, the older sister, walks slowly toward the door, her figure dwarfed by the height of the ceiling. Dust motes dance in the slivers of moonlight cutting through the gloom.",
        "cameraAngle": "Low",
        "movement": "Dolly",
        "lighting": "Chiaroscuro",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_1_1.png"
      },
      {
        "id": "shot_scene_1_2",
        "sceneId": "scene_1",
        "shotNumber": 2,
        "description": "Profile shot of the sister as she reaches the door. Her breath is visible in the cold air. She hesitates, her hand hovering inches from the rough wood before she slowly leans down. The slight handheld shake emphasizes her internal tremors and the nervous tension of the moment.",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "lighting": "Cold",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_1_2.png"
      },
      {
        "id": "shot_scene_1_3",
        "sceneId": "scene_1",
        "shotNumber": 3,
        "description": "A macro shot of the sister's eye approaching the rusted, oversized keyhole. The texture of the peeling paint and the cold iron of the keyhole are sharp and detailed. Her eyelashes brush against the metal as she aligns her vision with the opening.",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "lighting": "Dramatic",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_1_3.png"
      },
      {
        "id": "shot_scene_1_4",
        "sceneId": "scene_1",
        "shotNumber": 4,
        "description": "View through the keyhole, framed by a dark, circular vignette. Inside is a room frozen in time, covered in grey shrouds. Suddenly, a dark, blurred humanoid silhouette streaks across the frame from left to right with unnatural speed, momentarily blocking the faint light from a window inside.",
        "cameraAngle": "Eye-level",
        "movement": "Pan",
        "lighting": "Silhouette",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_1_4.png"
      },
      {
        "id": "shot_scene_1_5",
        "sceneId": "scene_1",
        "shotNumber": 5,
        "description": "A tight shot on the sister's eye. The iris is vibrant but the pupil suddenly dilates to its maximum size. The skin around her eye tightens as her brow furrows in a realization of pure horror. A tiny reflection of the moving shadow can be seen in the moisture of her cornea.",
        "cameraAngle": "Eye-level",
        "movement": "Zoom",
        "lighting": "Dramatic",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_1_5.png"
      },
      {
        "id": "shot_scene_1_6",
        "sceneId": "scene_1",
        "shotNumber": 6,
        "description": "The sister violently recoils from the door, stumbling backward. The camera tracks back with her as she gasps for air, her back hitting the opposite wall of the narrow hallway. She is now bathed in deep shadow, looking small and vulnerable against the vastness of the house.",
        "cameraAngle": "High",
        "movement": "Tracking",
        "lighting": "Chiaroscuro",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_1_6.png"
      },
      {
        "id": "shot_scene_2_1",
        "sceneId": "scene_2",
        "shotNumber": 1,
        "description": "A dusty courtyard in a traditional neighborhood at sunset. Children are scattered, playing with a ball. Their shadows are unnaturally long and thin, stretching across the scorched earth. The sun is a deep, bleeding orange on the horizon, casting long silhouettes.",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "lighting": "Natural",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_2_1.png"
      },
      {
        "id": "shot_scene_2_2",
        "sceneId": "scene_2",
        "shotNumber": 2,
        "description": "A tall, spindly figure emerges from the corner of a mud-brick wall. He is a dark silhouette against the bruised purple sky. His limbs are disproportionately long, and his face is obscured by deep shadows. He doesn't walk; he glides with a jerky, unnatural rhythm.",
        "cameraAngle": "Low",
        "movement": "Pan",
        "lighting": "Silhouette",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_2_2.png"
      },
      {
        "id": "shot_scene_2_3",
        "sceneId": "scene_2",
        "shotNumber": 3,
        "description": "The stranger enters the frame from the left, stalking toward the children. The camera shakes slightly, mimicking the rising heartbeat of an observer. The children in the background are blurred out of focus, still laughing, unaware of the predator approaching.",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "lighting": "Chiaroscuro",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_2_3.png"
      },
      {
        "id": "shot_scene_2_4",
        "sceneId": "scene_2",
        "shotNumber": 4,
        "description": "A sudden, violent movement. A pale, skeletal hand with elongated, gnarled fingers lunges forward and clamps firmly around the throat of a young girl. The skin of the hand is grey and textured like dry earth. The girl’s small hands reach up to pull at the iron-like grip.",
        "cameraAngle": "Low",
        "movement": "Dolly",
        "lighting": "Dramatic",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_2_4.png"
      },
      {
        "id": "shot_scene_2_5",
        "sceneId": "scene_2",
        "shotNumber": 5,
        "description": "Focus on the girl's face. Her eyes are wide, pupils dilated in shock, reflecting the dying orange light of the sun. Her mouth is open in a silent scream as the air is cut off. The background is a swirl of dusty twilight colors.",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "lighting": "Hard",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_2_5.png"
      },
      {
        "id": "shot_scene_2_6",
        "sceneId": "scene_2",
        "shotNumber": 6,
        "description": "The final composition is tilted. The tall man towers over the girl, his body a jagged black shape against the darkening sky. The other children are frozen in the distance, paralyzed like statues in the dimming 'Maghrib' light. The atmosphere is heavy with dust and silence.",
        "cameraAngle": "Dutch",
        "movement": "Static",
        "lighting": "Soft",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_2_6.png"
      },
      {
        "id": "shot_scene_3_1",
        "sceneId": "scene_3",
        "shotNumber": 1,
        "description": "A tall, shadowy figure with indistinct, glitch-like features looms over a young girl in a dilapidated, moonlit stone corridor. The figure's hand is clamped around her throat, lifting her slightly. The girl's face is a mask of pure terror, her eyes wide and bloodshot. Dust motes dance in the harsh shafts of moonlight.",
        "cameraAngle": "Low",
        "movement": "Handheld",
        "lighting": "Chiaroscuro",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_3_1.png"
      },
      {
        "id": "shot_scene_3_2",
        "sceneId": "scene_3",
        "shotNumber": 2,
        "description": "The entity's face, or the void where a face should be, suddenly ripples like a reflection in disturbed water. A brief, blinding flash of blue-white light—like a silent lightning strike—originates from the center of the entity's form, causing the screen to briefly blow out to white.",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "lighting": "Hard",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_3_2.png"
      },
      {
        "id": "shot_scene_3_3",
        "sceneId": "scene_3",
        "shotNumber": 3,
        "description": "The entity has vanished instantly. The girl falls to the dusty floor, the empty space where the figure stood now filled only with swirling dust and lingering blue static. Her brother stands paralyzed in the background, his silhouette trembling against the ancient stone walls.",
        "cameraAngle": "High",
        "movement": "Dolly",
        "lighting": "Cold",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_3_3.png"
      },
      {
        "id": "shot_scene_3_4",
        "sceneId": "scene_3",
        "shotNumber": 4,
        "description": "Focus on the girl on the ground. She is coughing violently, her small hands clutching her neck where faint, glowing red finger marks are visible. Her breath comes in ragged gasps, and her eyes move frantically, searching the empty shadows around her.",
        "cameraAngle": "Low",
        "movement": "Handheld",
        "lighting": "Dramatic",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_3_4.png"
      },
      {
        "id": "shot_scene_3_5",
        "sceneId": "scene_3",
        "shotNumber": 5,
        "description": "The children scramble to their feet and sprint away from the camera into the dark, misty woods surrounding the ruins. Their movement is hysterical and uncoordinated. The camera follows them from behind as they are swallowed by the darkness, leaving the haunted location silent and still under the moonlight.",
        "cameraAngle": "Eye-level",
        "movement": "Tracking",
        "lighting": "Natural",
        "dialogue": "",
        "imageUrl": "/api/cloud/file?path=production_story_1770902144002%2Fvisuals%2Fshot_shot_scene_3_5.png"
      }
    ],
    "genre": "Mystery",
    "isLocked": true,
    "lockedAt": "2026-02-12T13:18:02.526Z",
    "version": "locked_v1",
    "shots": [
      {
        "id": "shot_scene_0_1",
        "sceneId": "scene_0",
        "shotNumber": 1,
        "shotType": "Wide",
        "cameraAngle": "Eye-level",
        "movement": "Zoom",
        "duration": 6,
        "description": "An expansive aerial view of the Northern Saudi Arabian desert at golden hour. The orange sand dunes ripple infinitely like a frozen sea. In the dead center, a solitary, large white stone structure stands perfectly isolated, casting a long, distorted shadow across the sand. The scale emphasizes the 'Land of Jinn' vastness.",
        "emotion": "Awe and Isolation",
        "lighting": "Natural"
      },
      {
        "id": "shot_scene_0_2",
        "sceneId": "scene_0",
        "shotNumber": 2,
        "shotType": "Medium",
        "cameraAngle": "Low",
        "movement": "Dolly",
        "duration": 5,
        "description": "Approaching the 'White Palace.' The architecture is a haunting mix of traditional Najdi style and decaying grandeur. The white limestone walls are cracked and sun-bleached. The low angle makes the building feel imposing and sentient, like a giant watching a child approach.",
        "emotion": "Mystery",
        "lighting": "Chiaroscuro"
      },
      {
        "id": "shot_scene_0_3",
        "sceneId": "scene_0",
        "shotNumber": 3,
        "shotType": "POV",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "duration": 4,
        "description": "The camera mimics the height of a small child looking up at the massive, arched wooden doorway of the palace. The wood is splintered and weathered. The sun is positioned directly behind the roofline, creating a blinding halo effect that obscures the details of the upper floors, making it look heavenly yet terrifying.",
        "emotion": "Nostalgia mixed with Fear",
        "lighting": "Silhouette"
      },
      {
        "id": "shot_scene_0_4",
        "sceneId": "scene_0",
        "shotNumber": 4,
        "shotType": "Close-up",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "duration": 3,
        "description": "Focus on a single, rusted iron ring knocker on the white door. Dust particles swirl in a sharp, narrow beam of light hitting the metal. In the background, the blurred desert heat haze shimmers, suggesting a supernatural presence or a distorted memory.",
        "emotion": "Tense",
        "lighting": "Dramatic"
      },
      {
        "id": "shot_scene_0_5",
        "sceneId": "scene_0",
        "shotNumber": 5,
        "shotType": "Medium",
        "cameraAngle": "Dutch",
        "movement": "Pan",
        "duration": 5,
        "description": "A slow pan across a broken window frame on the ground floor. The interior is pitch black, creating a 'cold' visual void that contrasts with the burning orange sand outside. The slight tilt of the Dutch angle suggests that something about this place is fundamentally 'wrong' or supernatural.",
        "emotion": "Eerie",
        "lighting": "Cold"
      },
      {
        "id": "shot_scene_0_6",
        "sceneId": "scene_0",
        "shotNumber": 6,
        "shotType": "Wide",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "duration": 7,
        "description": "The palace captured during 'Blue Hour.' The warmth of the desert has vanished, replaced by a chilling deep blue hue. The building glows with an unnatural, pale luminescence against the darkening sky. It looks like a ghost haunting the dunes, perfectly capturing the 'cold shiver' of the childhood memory.",
        "emotion": "Dread",
        "lighting": "Natural"
      },
      {
        "id": "shot_scene_1_1",
        "sceneId": "scene_1",
        "shotNumber": 1,
        "shotType": "Wide",
        "cameraAngle": "Low",
        "movement": "Dolly",
        "duration": 6,
        "description": "A long, dimly lit hallway of an abandoned Victorian mansion. At the end of the corridor stands a massive, weathered wooden door with ornate iron carvings. A young woman, the older sister, walks slowly toward the door, her figure dwarfed by the height of the ceiling. Dust motes dance in the slivers of moonlight cutting through the gloom.",
        "emotion": "anticipation",
        "lighting": "Chiaroscuro"
      },
      {
        "id": "shot_scene_1_2",
        "sceneId": "scene_1",
        "shotNumber": 2,
        "shotType": "Medium",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "duration": 4,
        "description": "Profile shot of the sister as she reaches the door. Her breath is visible in the cold air. She hesitates, her hand hovering inches from the rough wood before she slowly leans down. The slight handheld shake emphasizes her internal tremors and the nervous tension of the moment.",
        "emotion": "anxiety",
        "lighting": "Cold"
      },
      {
        "id": "shot_scene_1_3",
        "sceneId": "scene_1",
        "shotNumber": 3,
        "shotType": "Close-up",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "duration": 3,
        "description": "A macro shot of the sister's eye approaching the rusted, oversized keyhole. The texture of the peeling paint and the cold iron of the keyhole are sharp and detailed. Her eyelashes brush against the metal as she aligns her vision with the opening.",
        "emotion": "curiosity",
        "lighting": "Dramatic"
      },
      {
        "id": "shot_scene_1_4",
        "sceneId": "scene_1",
        "shotNumber": 4,
        "shotType": "POV",
        "cameraAngle": "Eye-level",
        "movement": "Pan",
        "duration": 5,
        "description": "View through the keyhole, framed by a dark, circular vignette. Inside is a room frozen in time, covered in grey shrouds. Suddenly, a dark, blurred humanoid silhouette streaks across the frame from left to right with unnatural speed, momentarily blocking the faint light from a window inside.",
        "emotion": "terror",
        "lighting": "Silhouette"
      },
      {
        "id": "shot_scene_1_5",
        "sceneId": "scene_1",
        "shotNumber": 5,
        "shotType": "Close-up",
        "cameraAngle": "Eye-level",
        "movement": "Zoom",
        "duration": 3,
        "description": "A tight shot on the sister's eye. The iris is vibrant but the pupil suddenly dilates to its maximum size. The skin around her eye tightens as her brow furrows in a realization of pure horror. A tiny reflection of the moving shadow can be seen in the moisture of her cornea.",
        "emotion": "shock",
        "lighting": "Dramatic"
      },
      {
        "id": "shot_scene_1_6",
        "sceneId": "scene_1",
        "shotNumber": 6,
        "shotType": "Medium",
        "cameraAngle": "High",
        "movement": "Tracking",
        "duration": 5,
        "description": "The sister violently recoils from the door, stumbling backward. The camera tracks back with her as she gasps for air, her back hitting the opposite wall of the narrow hallway. She is now bathed in deep shadow, looking small and vulnerable against the vastness of the house.",
        "emotion": "fear",
        "lighting": "Chiaroscuro"
      },
      {
        "id": "shot_scene_2_1",
        "sceneId": "scene_2",
        "shotNumber": 1,
        "shotType": "Wide",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "duration": 6,
        "description": "A dusty courtyard in a traditional neighborhood at sunset. Children are scattered, playing with a ball. Their shadows are unnaturally long and thin, stretching across the scorched earth. The sun is a deep, bleeding orange on the horizon, casting long silhouettes.",
        "emotion": "ominous",
        "lighting": "Natural"
      },
      {
        "id": "shot_scene_2_2",
        "sceneId": "scene_2",
        "shotNumber": 2,
        "shotType": "Medium",
        "cameraAngle": "Low",
        "movement": "Pan",
        "duration": 5,
        "description": "A tall, spindly figure emerges from the corner of a mud-brick wall. He is a dark silhouette against the bruised purple sky. His limbs are disproportionately long, and his face is obscured by deep shadows. He doesn't walk; he glides with a jerky, unnatural rhythm.",
        "emotion": "dread",
        "lighting": "Silhouette"
      },
      {
        "id": "shot_scene_2_3",
        "sceneId": "scene_2",
        "shotNumber": 3,
        "shotType": "Medium",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "duration": 5,
        "description": "The stranger enters the frame from the left, stalking toward the children. The camera shakes slightly, mimicking the rising heartbeat of an observer. The children in the background are blurred out of focus, still laughing, unaware of the predator approaching.",
        "emotion": "suspenseful",
        "lighting": "Chiaroscuro"
      },
      {
        "id": "shot_scene_2_4",
        "sceneId": "scene_2",
        "shotNumber": 4,
        "shotType": "Close-up",
        "cameraAngle": "Low",
        "movement": "Dolly",
        "duration": 5,
        "description": "A sudden, violent movement. A pale, skeletal hand with elongated, gnarled fingers lunges forward and clamps firmly around the throat of a young girl. The skin of the hand is grey and textured like dry earth. The girl’s small hands reach up to pull at the iron-like grip.",
        "emotion": "terror",
        "lighting": "Dramatic"
      },
      {
        "id": "shot_scene_2_5",
        "sceneId": "scene_2",
        "shotNumber": 5,
        "shotType": "Close-up",
        "cameraAngle": "Eye-level",
        "movement": "Handheld",
        "duration": 5,
        "description": "Focus on the girl's face. Her eyes are wide, pupils dilated in shock, reflecting the dying orange light of the sun. Her mouth is open in a silent scream as the air is cut off. The background is a swirl of dusty twilight colors.",
        "emotion": "panic",
        "lighting": "Hard"
      },
      {
        "id": "shot_scene_2_6",
        "sceneId": "scene_2",
        "shotNumber": 6,
        "shotType": "Wide",
        "cameraAngle": "Dutch",
        "movement": "Static",
        "duration": 5,
        "description": "The final composition is tilted. The tall man towers over the girl, his body a jagged black shape against the darkening sky. The other children are frozen in the distance, paralyzed like statues in the dimming 'Maghrib' light. The atmosphere is heavy with dust and silence.",
        "emotion": "helplessness",
        "lighting": "Soft"
      },
      {
        "id": "shot_scene_3_1",
        "sceneId": "scene_3",
        "shotNumber": 1,
        "shotType": "Medium",
        "cameraAngle": "Low",
        "movement": "Handheld",
        "duration": 5,
        "description": "A tall, shadowy figure with indistinct, glitch-like features looms over a young girl in a dilapidated, moonlit stone corridor. The figure's hand is clamped around her throat, lifting her slightly. The girl's face is a mask of pure terror, her eyes wide and bloodshot. Dust motes dance in the harsh shafts of moonlight.",
        "emotion": "Pure Terror",
        "lighting": "Chiaroscuro"
      },
      {
        "id": "shot_scene_3_2",
        "sceneId": "scene_3",
        "shotNumber": 2,
        "shotType": "Close-up",
        "cameraAngle": "Eye-level",
        "movement": "Static",
        "duration": 3,
        "description": "The entity's face, or the void where a face should be, suddenly ripples like a reflection in disturbed water. A brief, blinding flash of blue-white light—like a silent lightning strike—originates from the center of the entity's form, causing the screen to briefly blow out to white.",
        "emotion": "Shock",
        "lighting": "Hard"
      },
      {
        "id": "shot_scene_3_3",
        "sceneId": "scene_3",
        "shotNumber": 3,
        "shotType": "Wide",
        "cameraAngle": "High",
        "movement": "Dolly",
        "duration": 6,
        "description": "The entity has vanished instantly. The girl falls to the dusty floor, the empty space where the figure stood now filled only with swirling dust and lingering blue static. Her brother stands paralyzed in the background, his silhouette trembling against the ancient stone walls.",
        "emotion": "Disorientation",
        "lighting": "Cold"
      },
      {
        "id": "shot_scene_3_4",
        "sceneId": "scene_3",
        "shotNumber": 4,
        "shotType": "Close-up",
        "cameraAngle": "Low",
        "movement": "Handheld",
        "duration": 4,
        "description": "Focus on the girl on the ground. She is coughing violently, her small hands clutching her neck where faint, glowing red finger marks are visible. Her breath comes in ragged gasps, and her eyes move frantically, searching the empty shadows around her.",
        "emotion": "Trauma",
        "lighting": "Dramatic"
      },
      {
        "id": "shot_scene_3_5",
        "sceneId": "scene_3",
        "shotNumber": 5,
        "shotType": "Wide",
        "cameraAngle": "Eye-level",
        "movement": "Tracking",
        "duration": 8,
        "description": "The children scramble to their feet and sprint away from the camera into the dark, misty woods surrounding the ruins. Their movement is hysterical and uncoordinated. The camera follows them from behind as they are swallowed by the darkness, leaving the haunted location silent and still under the moonlight.",
        "emotion": "Hysteria",
        "lighting": "Natural"
      }
    ],
    "scenesWithShots": [
      "scene_0",
      "scene_1",
      "scene_2",
      "scene_3"
    ],
    "visualStyle": "DARK_FANTASY",
    "imageProvider": "deapi",
    "scenesWithVisuals": [
      "scene_0",
      "scene_1",
      "scene_2",
      "scene_3"
    ],
    "narrationSegments": [
      {
        "sceneId": "scene_0",
        "audioUrl": "/api/cloud/file?path=production_story_1770902144002%2Faudio%2Fnarration_scene_0.wav",
        "duration": 51.81095833333333,
        "text": "مزيج متناقض بين حنين الطفولة البريء والشعور بقشعريرة باردة تسري في الجسد عند تذكر \"ذلك المكان\" تحديدًا. التأسيس للمكان والزمان. نحن في شمال السعودية، منطقة صحراوية شاسعة معروفة شعبيًا بأنها \"مسكن للجن\". الكاميرا (أو السرد) تركز على ذكريات الطفولة حول \"البيت الأبيض الكبير\"، ذلك المبنى المهجور الذي يقف وحيدًا ومعزولًا، والذي كان الأطفال ينجذبون إليه بفضول قاتل رغم تحذيرات الكبار المستمرة. ٢."
      },
      {
        "sceneId": "scene_1",
        "audioUrl": "/api/cloud/file?path=production_story_1770902144002%2Faudio%2Fnarration_scene_1.wav",
        "duration": 47.81095833333333,
        "text": "التوتر الخانق وحبس الأنفاس؛ تلك اللحظة التي يغلب فيها الفضول على الخوف، لتكتشف ما لا يجب أن تراه. تقترب الأخت الكبرى بجرأة من الباب الخشبي الضخم للبيت المهجور. تنحني لتختلس النظر عبر \"ثقب المفتاح\". السكون مخيف، وفجأة تتسع حدقة عينها رعبًا؛ فهي لا ترى ظلامًا دامسًا فحسب، بل ترى \"شيئًا\" يتحرك بوضوح في الداخل، خيالًا يمر بسرعة لا تتناسب مع كونه مكانًا مهجورًا منذ عقود. ٣."
      },
      {
        "sceneId": "scene_2",
        "audioUrl": "/api/cloud/file?path=production_story_1770902144002%2Faudio%2Fnarration_scene_2.wav",
        "duration": 39.650958333333335,
        "text": "الرعب الفطري المرتبط بـ \"وقت الغروب\" في الثقافة المحلية، وتحول اللعب إلى صراع مفاجئ من أجل البقاء. تحل ساعة \"صلاة المغرب\" (الوقت الذي يُحذّر فيه من انتشار الشياطين). بينما الأطفال يلعبون في الخارج، يظهر فجأة \"رجل غامض\" طويل القامة، ملامحه غير واضحة. لا يمشي كالبشر بل يتربص بهم. في لحظة خاطفة، يهجم الرجل ويمسك بإحدى الأخوات، وتبدأ أصابع يده القاسية بالالتفاف حول عنقها محاولًا خنقها وسط صراخ البقية المتجمد في حناجرهم. ٤."
      },
      {
        "sceneId": "scene_3",
        "audioUrl": "/api/cloud/file?path=production_story_1770902144002%2Faudio%2Fnarration_scene_3.wav",
        "duration": 40.730958333333334,
        "text": "الصدمة والذهول النفسي الذي يترك ندوبًا لا تمحى؛ الإدراك بأن ما واجهوه لم يكن بشريًا. بينما يبلغ الرعب ذروته ويظن الأطفال أن النهاية قد حانت، يختفي الرجل فجأة وبشكل مستحيل فيزيائيًا. يتبخر \"كالبرق\" أمام أعينهم، تاركًا الأخت تسعل وتمسك عنقها. ينتهي المشهد بالهروب الجماعي الهستيري، واليقين التام بأن حكايات الأهالي عن سكن الجن لتلك المنطقة لم تكن مجرد أساطير، بل حقيقة عاشوها بأنفسهم."
      }
    ],
    "scenesWithNarration": [
      "scene_0",
      "scene_1",
      "scene_2",
      "scene_3"
    ],
    "animatedShots": [],
    "shotsWithAnimation": [],
    "finalVideoUrl": "/api/cloud/file?path=production_story_1770902144002%2Fexports%2Fexport_2026-02-12T13-32-47-074Z.mp4"
  },
  "metadata": {
    "totalScenes": 4,
    "totalShots": 23,
    "totalCharacters": 3,
    "visualStyle": "DARK_FANTASY",
    "duration": 113
  }
}